# GetClipRectangle Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DrawContext..::..GetClipRectangle Method
DrawContext Class See Also
---
Gets the clip rectangle for the Revit view where rendering takes place. The clip rectangle is the area currently being redrawn, which may be smaller than the view rectangle.
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public static Rectangle GetClipRectangle()
```

Visual Basic
---
```text
Public Shared Function GetClipRectangle As Rectangle
```

Visual C++
---
```text
public:
static Rectangle^ GetClipRectangle()
```

# ### Return Value
The clip rectangle.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This DrawContext is not available because Revit is not currently rendering. In general, this DrawContext must be used in the scope of the RenderScene() callback of IDirectContext3DServer. |

# See Also
DrawContext Class
Autodesk.Revit.DB.DirectContext3D Namespace